examples/calls/getAttemptList.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <soap:Header>
    <wsa:Action>urn:GetAttemptList</wsa:Action>
    <wsa:MessageID>urn:uuid:bfa7e68e-02c8-4c85-9400-65110c1fb28a</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:To>http://dev1.rusticisoftware.com/ScormEngineWS/ws/RTWS/LETSI_RTWS.asmx</wsa:To>
    <wsse:Security soap:mustUnderstand="1">
      <wsu:Timestamp wsu:Id="Timestamp-b921f26c-980b-454b-b091-0b648108186a">
        <wsu:Created>2010-07-10T19:42:52Z</wsu:Created>
        <wsu:Expires>2010-07-10T19:47:52Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-3eebc06b-bb57-4474-b9d0-d73092c5ac94">
        <wsse:Username>UserName|Ben!CourseId|1001!InstanceId|0</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">75zfKHB9WusKNM/gaOGezRjxE5Q=</wsse:Password>
        <wsse:Nonce>fvypEqZO7cDLhqXHeQO8Lw==</wsse:Nonce>
        <wsu:Created>2010-07-10T19:42:52Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <GetAttemptList xmlns="http://letsi.org/rte/1.0" />
  </soap:Body>
</soap:Envelope>